export const data = `

# 准备

[领事馆](http://cs.mfa.gov.cn/zggmcg/ljmdd/yz_645708/)

## 签证 

> 提前一、二个月申请

+ [土耳其签证申请](https://www.evisa.gov.tr/zh/apply/) **国庆 / 五一**
+ [尼泊尔签证申请](https://nepaliport.immigration.gov.np/eta-visa-processing) **国庆 / 五一**
+ [泰国签证申请](www.thaiembbeij.org/thaiembbeij/cn/thai-service/visa) **春节 / 五一**
+ 日本签证（代理商申请 **国庆 / 五一**

## 物品准备

+ 药品
+ 现金
+ 洗漱用品
+ 转换头、电话卡、充电宝

## 旅行建议

### 土耳其

> 最佳旅游时间通常被认为是**春季（4月-5月）和秋季（9月-10月）**，以及**12月**。以下是具体的解释：

* **春季（4月-5月）** ：此时气候温和，既没有冬天的寒冷，也没有夏天的炎热，天空透彻晴朗，非常适合拍照。土耳其此时进入了旅游旺季，但游客数量相对于夏季会少一些，因此您可以更轻松地游览景点。
* **秋季（9月-10月）** ：与春季类似，秋季的气候也非常宜人，而且游客数量相对较少，住宿和食物的价格也会更便宜。此时前往土耳其旅游，您可以更好地享受当地的风景和文化。
* **12月**：如果您想避开旅游高峰期并体验独特的景色，12月是一个不错的选择。此时没有强烈的阳光反射，游客数量较少，而且山下山上冰火两重天的强烈反差会给您带来一种难得的体验。

### 尼泊尔

> 最佳旅游时间通常被认为是**秋季（9月至11月）**和**春季（3月至5月）**。

* **秋季：** 天气温和干燥，非常适合徒步旅行和其他户外活动。这是尼泊尔的旅游旺季，但游客数量相对较少，因此您可以更轻松地游览景点。同时，秋季也是观赏尼泊尔美丽自然风光和体验当地文化的最佳时间。

* **春季：** 天气同样温和宜人，植被茂盛，鲜花盛开，给尼泊尔增添了别样的魅力。此时也是徒步旅行和探险活动的好时机。

需要注意的是，尼泊尔的冬季（12月至2月）可能会非常寒冷，尤其是在山区，而夏季（6月至8月）则炎热潮湿并伴有季风降雨，因此这两个季节可能不太适合旅游。

### 泰国

> **11月到次年2月**是泰国大部分地区的旅游最佳时间。这个时间段是泰国的凉季，气温适中，降雨较少，非常适合旅游和度假。

* 具体来说，泰国南部最佳旅游时间为**3月到5月**，此时天气晴朗，适合海滩度假和水上活动。而泰国北部如清迈等地，最佳旅游时间则为**11月中旬至2月**，此时天气凉爽，适合徒步旅行和感受泰国北部的自然风光和民俗文化。

* 此外，泰国的旅游旺季一般是**12月和8月**，这两个月份的游客数量较多，但天气也相对宜人，适合旅游。而淡季则是**5月、6月和9月**，此时游客数量较少，但天气可能较为炎热或多雨，需要根据个人喜好和行程安排进行选择。

### 日本

> 一般来说，**春季（3月至5月）** 和 **秋季（9月至11月）** 被认为是日本的最佳旅游时间。

* **春季**是日本**赏樱**的最佳季节，此时樱花由南至北逐渐绽放，形成了一条美丽的“樱前线”。在东京、京都等地，您可以欣赏到盛开的樱花，感受日本的浪漫气息。此外，春季也是日本各地举办各种传统活动和庆典的季节，如金泽的“兼六园祭”和京都的“祗园祭”等。

* **秋季**则是日本赏**红叶**的最佳时间，此时枫叶由北至南逐渐变红，层林尽染，红叶遍地。京都、青森等地是赏枫的好去处。此外，秋季还是观赏菊花的好时节，日本各地会举办各种菊花展览和赏菊活动。同时，秋季也是日本的“文化之秋”，会举办各种展览会、音乐会、体育竞赛等文化活动。

* 除了春季和秋季，夏季（6月至8月）也是日本的旅游旺季之一。此时，日本的海滨浴场和山麓是避暑的好去处。许多地区会举办一年中最热闹的传统祭典，如东京的“神田祭”和大阪的“天神祭”等。此外，7月中旬北海道的富良野彩虹花田盛开，吸引了众多游客前来观赏。

* 冬季（12月至2月）虽然寒冷，但日本的雪景和温泉也是一大魅力。您可以去北国滑雪泡温泉，或者去冲绳避寒观鲸鱼。此外，冬季还是购物的最佳打折季，您可以在大城市尽情采购。

`