export const data = `

# 准备

[领事馆](http://cs.mfa.gov.cn/zggmcg/ljmdd/yz_645708/)

## 签证 

> 提前一、二个月申请

+ [土耳其签证申请](https://www.evisa.gov.tr/zh/apply/) **国庆 / 五一**
+ [泰国签证申请](www.thaiembbeij.org/thaiembbeij/cn/thai-service/visa) **春节 / 五一**

## 物品准备

+ 药品
+ 现金
+ 洗漱用品
+ 转换头、电话卡、充电宝

## 旅行建议

### 土耳其

> 最佳旅游时间通常被认为是**春季（4月-5月）和秋季（9月-10月）**，以及**12月**。以下是具体的解释：

* **春季（4月-5月）** ：此时气候温和，既没有冬天的寒冷，也没有夏天的炎热，天空透彻晴朗，非常适合拍照。土耳其此时进入了旅游旺季，但游客数量相对于夏季会少一些，因此您可以更轻松地游览景点。
* **秋季（9月-10月）** ：与春季类似，秋季的气候也非常宜人，而且游客数量相对较少，住宿和食物的价格也会更便宜。此时前往土耳其旅游，您可以更好地享受当地的风景和文化。
* **12月**：如果您想避开旅游高峰期并体验独特的景色，12月是一个不错的选择。此时没有强烈的阳光反射，游客数量较少，而且山下山上冰火两重天的强烈反差会给您带来一种难得的体验。

### 泰国

> **11月到次年2月**是泰国大部分地区的旅游最佳时间。这个时间段是泰国的凉季，气温适中，降雨较少，非常适合旅游和度假。

* 具体来说，泰国南部最佳旅游时间为**3月到5月**，此时天气晴朗，适合海滩度假和水上活动。而泰国北部如清迈等地，最佳旅游时间则为**11月中旬至2月**，此时天气凉爽，适合徒步旅行和感受泰国北部的自然风光和民俗文化。

* 此外，泰国的旅游旺季一般是**12月和8月**，这两个月份的游客数量较多，但天气也相对宜人，适合旅游。而淡季则是**5月、6月和9月**，此时游客数量较少，但天气可能较为炎热或多雨，需要根据个人喜好和行程安排进行选择。

`