export interface IDataEntity {
    [date: string]: {
        income: number,
        expenditure: {
            total: number,
            [types: string]: number
        }
    }
}

const data2024: IDataEntity = {
    '2024-5': {
        income: 13000,
        expenditure: {
            total: 4341.9,
            '食物': 916,
            '外卖': 393,
            '日用': 225,
            '旅行': 402,
            '交通': 77.4,
            '房租': 2000,
            '网购': 328.5,
        }
    },
    '2024-4': {
        income: 13075,
        expenditure: {
            total: 7002.3,
            '食物': 515,
            '外卖': 496.5,
            '日用': 674,
            '旅行': 3102,
            '交通': 82.8,
            '房租': 2000,
            '网购': 132,
        }
    },
    '2024-3': {
        income: 13000,
        expenditure: {
            total: 7372.2,
            '食物': 858,
            '外卖': 219,
            '日用': 136.8,
            '旅行': 3118.7,
            '交通': 0,
            '房租': 2000,
            '网购': 1039.7,
        }
    },
    '2024-2': {
        income: 1200 + 14594,
        expenditure: {
            total: 25785.3,
            '食物': 44.5,
            '外卖': 712,
            '日用': 20843.3,
            '旅行': 1776.5,
            '交通': 0,
            '房租': 2000,
            '网购': 409,
        }
    },
    '2024-1': {
        income: 15200,
        expenditure: {
            total: 5400.5,
            '食物': 581,
            '外卖': 825.5,
            '日用': 226,
            '旅行': 998,
            '交通': 0,
            '房租': 2000,
            '网购': 770,
        }
    },
}

const data2023: IDataEntity = {
    '2023-12': {
        income: 2400 + 12500,
        expenditure: {
            total: 7992.6,
            '食物': 315,
            '外卖': 998.6,
            '日用': 500 + 3564,
            '旅行': 245,
            '交通': 0,
            '房租': 2000,
            '网购': 370,
        }
    },
    '2023-11': {
        income: 13500,
        expenditure: {
            total: 4433.4,
            '食物': 468.4,
            '外卖': 851,
            '日用': 399 + 500,
            '旅行': 0,
            '交通': 0,
            '房租': 2000,
            '网购': 215,
        }
    },
    '2023-10': {
        income: 12500,
        expenditure: {
            total: 5517.6,
            '食物': 703.9,
            '外卖': 542.7,
            '日用': 500 + 691,
            '旅行': 833,
            '交通': 0,
            '房租': 2000,
            '网购': 247,
        }
    },
    '2023-9': {
        income: 12500,
        expenditure: {
            total: 7357,
            '食物': 543,
            '外卖': 679,
            '日用': 500 + 1169.5,
            '旅行': 1882.5,
            '交通': 0,
            '房租': 2000,
            '网购': 583,
        }
    },
    '2023-8': {
        income: 12200,
        expenditure: {
            total: 9266.5,
            '食物': 277.5,
            '外卖': 967,
            '日用': 4000 + 1892,
            '旅行': 0,
            '交通': 0,
            '房租': 2000,
            '网购': 130,
        }
    },
    '2023-7': {
        income: 12600,
        expenditure: {
            total: 3655,
            '食物': 632.5,
            '外卖': 558,
            '日用': 56,
            '旅行': 0,
            '交通': 0,
            '房租': 2000,
            '网购': 408.5,
        }
    },
    '2023-6': {
        income: 12950,
        expenditure: {
            total: 3892.5,
            '食物': 384,
            '外卖': 662.5,
            '日用': 659,
            '旅行': 0,
            '交通': 0,
            '房租': 2000,
            '网购': 187,
        }
    },
    '2023-5': {
        income: 13110,
        expenditure: {
            total: 3997.9,
            '食物': 605,
            '外卖': 620.5,
            '日用': 73,
            '旅行': 460.4,
            '交通': 0,
            '房租': 2000,
            '网购': 239,
        }
    },
    '2023-4': {
        income: 13151,
        expenditure: {
            total: 5729,
            '食物': 269.5,
            '外卖': 534,
            '日用': 194.5,
            '旅行': 1917,
            '交通': 0,
            '房租': 2000,
            '网购': 814,
        }
    },
    '2023-3': {
        income: 13130,
        expenditure: {
            total: 6635,
            '食物': 506.5,
            '外卖': 764,
            '日用': 837.5 + 979,
            '旅行': 807,
            '交通': 0,
            '房租': 2000,
            '网购': 741,
        }
    },
    '2023-2': {
        income: 13073,
        expenditure: {
            total: 4600.9,
            '食物': 293.4,
            '外卖': 539.5,
            '日用': 775,
            '旅行': 502,
            '交通': 0,
            '房租': 2000,
            '网购': 491,
        }
    },
    '2023-1': {
        income: 13034 + 900 + 500,
        expenditure: {
            total: 14501.5,
            '食物': 544,
            '外卖': 894.5,
            '日用': 93,
            '旅行': 0,
            '交通': 0,
            '房租': 2000,
            '网购': 50 + 10920,
        }
    },
}
export const data: IDataEntity = {
    ...data2024,
    ...data2023
}
