
export const traveled = ['内蒙古阿拉善盟', '宁夏银川', '云南丽江', '云南香格里拉', '西藏山南',
    '四川成都', '海南万宁', '贵州六盘水', '贵州铜仁', '湖南湘西', '云南德钦', '贵州黔南',
    '青海西宁', '西藏拉萨', '西藏日喀则', '陕西西安', '陕西渭南', '重庆', '四川乐山',
    '湖南长沙', '湖南怀化', '湖南张家界', '湖南常德', '四川阿坝', '四川甘孜', '四川凉山',
    '四川广元', '四川绵阳', '四川眉山', '四川泸州', '四川宜宾', '青海海东', '青海海西',
    '青海海北', '青海海南', '海南海口', '云南昆明']

export const detailInfo: { [key: string]: { title: string, time: string, [name: string]: number | string } } = {
    '湖南张家界': {
        title: '天门山两日',
        time: '2024.02.06 - 2024.02.07',
        name: '天门山 2024.02',
        '门票': 273,
        '吃饭': 111,
        '酒店': 123,
        '交通': 629,
    },
    '陕西渭南': {
        title: '华山两日',
        time: '2024.03.02 - 2024.03.03',
        name: '华山 2024.03',
        '交通': 724,
        '门票': 247,
        '吃饭': 49,
        '酒店': 110,
    },
    "海南万宁": {
        title: '万宁三日',
        time: '2024.04.04 - 2024.04.06',
        name: '万宁 2024.04',
        '吃饭': 280.5,
        '交通': 360.5,
        '酒店': 417,
        '机票': 1900,
    },
    '内蒙古阿拉善盟': {
        title: '腾格里沙漠五日',
        time: '2024.05.02 - 2024.05.06',
        name: '腾格里 2024.05',
        '吃饭': 213,
        '交通': 68,
        '机票': 1578,
        '酒店': 150,
        '跟团': 1440,
    },
}